{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "arguments": {}, "name": "lambda_1", "trainable": true, "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgb0DnAAAAAAAA\n4D+pACkB2gF4cgMAAAByAwAAAPoIbW9kZWwucHnaCDxsYW1iZGE+OgAAAHMAAAAA\n", null, null], "output_shape": null}}, {"class_name": "Cropping2D", "config": {"batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1", "cropping": [[50, 20], [0, 0]], "trainable": true, "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_1", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "filters": 24, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.2, "seed": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_2", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "filters": 36, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_3", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "filters": 48, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_4", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "filters": 64, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Conv2D", "config": {"activation": "relu", "name": "conv2d_5", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "filters": 64, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "rate": 0.5, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_1", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "units": 100, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "rate": 0.5, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_2", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "units": 50, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_3", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "units": 10, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dense", "config": {"activation": "linear", "name": "dense_4", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "units": 1, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}], "name": "sequential_1", "build_input_shape": [null, 160, 320, 3]}, "keras_version": "2.2.4"}